app/controllers/recipes_controller.rb

	def create
		@recipe = Recipe.new(recipe_params)
		if @recipe.save
---
INSERT INTO "recipes" ("name", "instructions", "ingredients", "picture") VALUES (?, ?, ?, ?)  [["name", "Egg2"], ["instructions", "2 eggs"], ["ingredients", "cook"], ["picture", "none"]]